---
kind: type
id: T:Autodesk.Revit.DB.Visual.PlasticvinylBumpType
source: html/253f5700-d828-c823-8aa6-ae400cac20d3.htm
---
# Autodesk.Revit.DB.Visual.PlasticvinylBumpType

The enumerated type representing the permitted values for the asset property "PlasticvinylBump" from the "PlasticVinyl" schema.

## Syntax (C#)
```csharp
public enum PlasticvinylBumpType
```